In [1]:
import pandas as pd

In [2]:
dict_data = {'a':1, 'b':2, 'c':3}

In [3]:
dict_data

{'a': 1, 'b': 2, 'c': 3}

In [5]:
sr = pd.Series(dict_data)
sr

a    1
b    2
c    3
dtype: int64

In [11]:
print(type(sr))
print(sr)

<class 'pandas.core.series.Series'>
a    1
b    2
c    3
dtype: int64

In [15]:
sr.values

array([1, 2, 3])

In [20]:
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]

In [21]:
type(list_data)

list

In [23]:
sr = pd.Series(list_data)
sr

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [25]:
idx = sr.index
idx

RangeIndex(start=0, stop=5, step=1)

In [26]:
val = sr.values
val

array(['2019-01-02', 3.14, 'ABC', 100, True], dtype=object)

In [29]:
print(idx)
print(val)

RangeIndex(start=0, stop=5, step=1)
['2019-01-02' 3.14 'ABC' 100 True]

In [30]:
tup_data = ('영인',  '2010-05-01', 'du', True)

In [33]:
sr = pd.Series(tup_data, index=['이름', '날짜', '성별', '학생여부'])

In [35]:
sr[0]

'영인'

In [36]:
sr['이름']

'영인'

In [44]:
sr[1:3]

날짜    2010-05-01
성별            du
dtype: object

In [46]:
sr['날짜': '성별']

날짜    2010-05-01
성별            du
dtype: object

In [48]:
dict_data = {'c0':[1, 2, 3], 'c1':[4, 5, 6], 'c2':[7, 8, 9], 'c3':[10, 11, 12], 'c4':[13, 14, 15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [55]:
df = pd.DataFrame(dict_data)

In [50]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [51]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [52]:
print(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [57]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
                 index=['준서', '예은'],
                 columns=['나이', '성별', '학교'])

In [58]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [59]:
df.index

Index(['준서', '예은'], dtype='object')

In [60]:
df.values

array([[15, '남', '덕영중'],
       [17, '여', '수리중']], dtype=object)

In [61]:
df.columns

Index(['나이', '성별', '학교'], dtype='object')

In [63]:
df.index = ['학생1', '학생2']

In [64]:
df.index

Index(['학생1', '학생2'], dtype='object')

In [65]:
df

     나이 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [67]:
df.columns = ['연령', '남녀', '소속']

In [68]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [69]:
df.rename(index={'학생1':'영재'})

     연령 남녀   소속
영재   15  남  덕영중
학생2  17  여  수리중

In [70]:
df.rename(columns={'소속':'중학교'})

     연령 남녀  중학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [73]:
exam_data = {'수학': [90, 80, 70], '영어': [98, 89,95], '음악': [85, 95, 100], '체육': [100, 90, 90]}

In [74]:
exam_data

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [76]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])

In [77]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [78]:
df2 = df[:]
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [82]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [83]:
df3 = df

In [84]:
df3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [86]:
df3.drop(['우현', '인아'], axis=0, inplace=True)

In [87]:
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [89]:
df3.drop(['영어', '음악'], axis=1, inplace=True)

In [90]:
df3

    수학   체육
서준  90  100

In [100]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [97]:
label1 = df.loc['서준']
label1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [99]:
position1 = df.iloc[0]
position1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [105]:
df['수학'].서준 = 10

In [107]:
df

    수학  영어   음악   체육
서준  10  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [108]:
label1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [110]:
df.iloc[1::2]

    수학  영어  음악  체육
우현  80  89  95  90

In [111]:
exam_data

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [112]:
df = pd.DataFrame(exam_data)
df

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90

In [113]:
df.loc[3] = 0

In [114]:
df

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90
3   0   0    0    0

In [115]:
df.loc[1] = 10

In [116]:
df

   수학  영어   음악   체육
0  90  98   85  100
1  10  10   10   10
2  70  95  100   90
3   0   0    0    0

In [117]:
df.loc['g'] = 1

In [118]:
df

   수학  영어   음악   체육
0  90  98   85  100
1  10  10   10   10
2  70  95  100   90
3   0   0    0    0
g   1   1    1    1

In [120]:
df.set_index('수학', inplace=True)

In [121]:
df

    영어   음악   체육
수학
90  98   85  100
10  10   10   10
70  95  100   90
0    0    0    0
1    1    1    1

In [123]:
df.loc[90]

영어     98
음악     85
체육    100
Name: 90, dtype: int64

In [124]:
df.iloc[2]

영어     95
음악    100
체육     90
Name: 70, dtype: int64

In [128]:
df = pd.DataFrame(exam_data)

In [129]:
df

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90

In [136]:
df.iloc[0][3] = 1

In [137]:
df

   수학  영어   음악  체육
0  90  98   85   1
1  80  89   95  90
2  70  95  100  90

In [138]:
df.iloc[0, 3] = 10

In [140]:
df

   수학  영어   음악  체육
0  90  98   85  10
1  80  89   95  90
2  70  95  100  90

In [142]:
df.iloc[0, [0, 1]] = 1, 1

In [143]:
df

   수학  영어   음악  체육
0   1   1   85  10
1  80  89   95  90
2  70  95  100  90

In [144]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [145]:
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])

In [146]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [147]:
new_index = ['r0','r1','r2','r3','r4']

In [148]:
new_index

['r0', 'r1', 'r2', 'r3', 'r4']

In [149]:
ndf = df.reindex(new_index)

In [151]:
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [152]:
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0